Autodesk.Revit.DB.ShowHiddenLinesValues
Provides options for display of hidden lines in a given view.

Autodesk.Revit.DB.ShowHiddenLinesValues.All
Show all hidden lines.

Autodesk.Revit.DB.ShowHiddenLinesValues.ByDiscipline
Show hidden lines according to discipline.

Autodesk.Revit.DB.ShowHiddenLinesValues.None
Do not show any hidden lines.